---
type: IdlingEventArgs
namespace: Autodesk.Revit.UI.Events
version: 2024
members: 1
tags: [revit-api, class]
---

# IdlingEventArgs

`Autodesk.Revit.UI.Events.IdlingEventArgs` · Revit 2024 · 1 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | SetRaiseWithoutDelay | — | `public void SetRaiseWithoutDelay ()` |